public class Dictionary {
  // Программисты, как вы уже знаете, постоянно учатся, а в общении между собой используют весьма
  // специфический язык. Чтобы систематизировать ваш пополняющийся профессиональный лексикон, мы
  // придумали эту задачу.
  // Напишите программу создания небольшого словаря сленговых программерских выражений, чтобы она
  // потом по запросу возвращала значения из этого словаря.
  // Файл `dict.txt`
  // В первой строке задано одно целое число `n` — количество слов в словаре.
  // В следующих `n` строках записаны слова и их определения, разделенные двоеточием и символом
  // пробела.
  // Для каждого слова, независимо от регистра символов, если оно присутствует в словаре,
  // необходимо вывести на экран его определение.
  // Если слова в словаре нет, программа должна вывести "Не найдено", без кавычек.

  public static void main(String[] args) {

  }

}
